
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьЭлементов()
	
	Если Запись.Сотрудник.КатегорияСотрудника = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе
		Элементы.ПроцентОтРабот.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти