#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	                |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	                |ИЗ
	                |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	                |ГДЕ
	                |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата)); 
	
	РезультатЗапроса = Запрос.Выполнить();    
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет данных для заполнения"; 
		Возврат; 
		
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		НС = Объект.Выплаты.Добавить();        
		НС.Сотрудник = Выборка.Сотрудник; 
		НС.Сумма = Выборка.СуммаОстаток; 
		
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчиковКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры 

#КонецОбласти
